{
  "english": "Dark Elves",
  "sigtaara": "KÄmisÄdhel",
  "native_name": "Zæmisædhail",
  "kingdom": "Firgolkys (Material Realm Beings)",
  "phylum": "Yoosaanuri (Arcane Vertebrates)",
  "class": "Duwanihii (Mammals)",
  "order": "Ursgizil (Humanoids)",
  "family": "Hadrimkirii (Mind Children)",
  "genus": "Aedhelkys (Elf Family)",
  "species": "Nomaal",
  "appeared_in_age": "second_age",
  "genetic_ancestors": [
    "Hah'Slen"
  ],
  "genetic_descendants": [
    "Kaekreaedhel"
  ],
  "origin": [
    "Nidis",
    "Solmi"
  ],
  "home_continent": "Siniath",
  "geographic_distribution": [
    "Siniath",
    "eastern mountains",
    "subterranean cave networks"
  ],
  "magical_affinity": [
    "Tazri"
  ],
  "hybrid": false,
  "culture": {
    "core_values": [
      "endurance through adversity",
      "resistance to domination",
      "freedom of identity",
      "strength and cunning",
      "loyalty to kin",
      "hierarchy based on achievement and beauty"
    ],
    "origins": "Formed through the banishment and magical manipulation of 'lesser' elven bloodlines by the Kaelotaedhel during the First Blood of the Boughs.",
    "society": "Structured and hierarchical, governed by standards of beauty, achievement, and magical prowess. Social mobility is possible through personal achievement.",
    "traditions": {
      "face-marking": "Ritual ink or scars mark life events, magical initiations, or vows.",
      "memory-chants": "History and law are preserved in communal rhythmic oral chants.",
      "silent-mourning": "The dead are transformed into trees via magical seeding—forests become ancestral groves.",
      "blood sacrifices": "Practiced as part of certain religious and magical rites.",
      "hair braiding": "Elaborate braids and knots in hair signify status, skill, and clan ties."
    },
    "conflicts": {
      "with_kaelotaedhel": "Ongoing hostility rooted in ancient exile and magical surveillance by Kaelotaedhel Arcanists.",
      "with_nil’thur": "Some clans reject divine influence, blaming the gods for ancestral suffering."
    },
    "diaspora": "Some clans fled Siniath, founding hidden settlements in Silgolt, Irudy, and beneath Hjemland.",
    "reputation": "Often misunderstood as inherently malevolent, but actually bound by strict codes of conduct and order. Known for arcane mastery, especially necromancy and blood magic.",
    "practices": [
      "Occasional slavery (mainly of non-elves, viewed as means to gain or achieve)",
      "Blood magic and dark enchantments"
    ],
    "related_organizations": [
      "The Cult of Esoteric Paradoxes"
    ]
  },
  "traits": {
    "appearance": "Tall, slender, and compactly muscled with sharp, angular features. Skin tones range from deep blue to near-black, sometimes with a pale or bluish/violet undertone. Eyes are large, radiant in darkness, and silver, white, pale blond, or ashen gray hair is common (sometimes braided in elaborate knots).",
    "magical_style": "Masters of shadow manipulation, necromancy, blood magic, and 'veilcraft' (tricks of light, memory, and illusion). Noted for 'echo magic' and strategic use of darkness in combat.",
    "lifespan": "300–340 years",
    "physiology": {
      "skeleton": "Bilateral; denser than surface elves; elongated fingers and toes for climbing.",
      "musculature": "Highly efficient, favoring agility and explosive movement over prolonged strength. Well-developed lower body for leaping and clinging to rock.",
      "respiration": "Adapted to thin, low-oxygen air; large lung capacity, high red blood cell count.",
      "circulation": "Efficient at heat regulation, suited for subterranean chill.",
      "dermal": "Skin is tough, abrasion-resistant, and slightly leathery.",
      "hair": "Ranges from white/silver to pale blond, ashen gray, or abyssal black; blends with cave environment.",
      "senses": [
        "Exceptional night vision; dense rods and tapetum lucidum in eyes.",
        "Acute hearing; detects subtle vibrations and shifts in rock/air.",
        "Heightened tactile sense in fingertips and toes.",
        "Sensitive to magical fluctuations, especially in arcane-rich environments."
      ],
      "adaptations": [
        "Vestigial nictitating membrane (secondary eyelid).",
        "Protective veils/tinted eyewear for sunlight.",
        "Echolocation (soft clicks/taps) used by tunnel explorers."
      ]
    },
    "reproduction": {
      "method": "Sexual",
      "cycle": "Low fertility, slower cycle than surface elves due to environmental and physiological constraints.",
      "gestation": "12–14 months",
      "development": "Children are born fragile, rely on hearing/touch at first, full night vision develops by ~20 years. Extended dependence on parents for first 10–15 years.",
      "courtship": "Extensive rituals involving demonstration of compatibility, lineage, and sensory traits. Many unions arranged communally.",
      "interbreeding": "Rare; offspring with surface elves have diminished night vision and light tolerance.",
      "cultural_influence": "Reproduction is a communal concern, balanced for survival and genetic health."
    },
    "growth": {
      "infancy": "0–10 years; physically fragile, underdeveloped eyesight, highly attuned hearing and touch.",
      "childhood": "10–50 years; refinement of senses and cave navigation; full night vision by 20.",
      "adolescence": "50–80 years; training, social/survival rituals, expanding independence.",
      "adulthood": "80–300 years; mastery of cave environment and integration into society.",
      "elderhood": "300–340 years; declining speed/senses but serve as mentors, lorekeepers, and spiritual guides."
    },
    "growth_rate": "Slow; physical maturity at 50–60, adulthood by 80–100 years."
  },
  "intelligence": {
    "type": "Intuitive, artistic, and emotionally nuanced.",
    "strengths": [
      "Pattern recognition",
      "Environmental awareness",
      "Interpersonal sensitivity"
    ],
    "learning_style": "Immersion, rhythm, and resonance rather than abstraction.",
    "comparison_to_human": "Superior in emotional intelligence and environmental adaptation; comparable in logical reasoning."
  },
  "controversies": [
    "Rumors of inherent evil perpetuated by surface societies.",
    "Occasional acceptance of slavery for personal or clan gain.",
    "Practices of blood magic, necromancy, and dark enchantments viewed with suspicion.",
    "False claims of instability or curse promoted by Kaelotaedhel.",
    "Historical accusations of forbidden hybrids predating Kaekreaedhel."
  ],
  "lore": {
    "origin_myth": "Banished and manipulated by the Kaelotaedhel during the First Blood of the Boughs.",
    "founders": [
    ],
    "core_legends": [
      "The Rite of Shadow Passage (testing adulthood and cave mastery)",
      "The Echo of the Abyss (ancestral memory rituals)"
    ],
    "taboos": [
      "Exposure of sensitive eyes to sunlight without protection.",
      "Revealing true names to outsiders."
    ]
  },
  "habitat": "Eastern Siniath, subterranean mountain ranges, extensive cave and tunnel systems.",
  "distribution": [
    "Siniath (native)",
    "Hidden diaspora in Silgolt, Irudy, beneath Hjemland"
  ],
  "related_species": [
    "Kaelotaedhel",
    "Zaetaedhel",
    "Kaekreaedhel"
  ],
  "notable_magic": [
    "Necromancy",
    "Blood magic",
    "Echo magic",
    "Veilcraft (illusion/manipulation of memory/shadow)"
  ],
  "related_organizations": [
    "The Cult of Esoteric Paradoxes"
  ],
  "subspecies": [
      "Kaekreaedhel"
    ]
}
