"Aedhelirsos":{
								"english":"Elvenborn (Hybrid)",
								"sigtaara":"ÄDHeLÍSOS",
								"family":"Kaesendova",
								"genus":"Dovahsos",
								"species":"Aedheldov",
								"appeared_in_age":"fourth_age",
								"genetic_ancestors":[
									"Kaelotaedhel",
									"Saarotsos"
								],
								"genetic_descendants":[
									
								],
								"home_continent":"Silgolt",
								"geographic_distribution":[
									
								],
								"magical_affinity":[
									"Tazri",
									"Kori"
								],
								"hybrid":true,
								"artificial":false,
								"culture":{
									"core_values":[
										"balance between forces",
										"self-definition through legacy",
										"honoring ancient echoes"
									],
									"society":"Solitary by nature and rare in number: Aedhelirsos are most often found in liminal spaces: high forests, flame-lit caverns, or polyethnic cities. Some serve as emissaries or seers, others as guardians of ancient truths. Their society is loose, woven more by memory and shared ritual than by blood.",
									"roles":[
										"emissaries",
										"seers",
										"guardians of old truths"
									],
									"traditions":{
										"spellweaving":"Aedhelirsos magic is sung or woven, blending Tazri and Kori in instinctive harmony rather than rigid technique.",
										"birthsigns":"Those born by magical rite are regarded as sacred extensions of legacy, with their coming often foretold by omens.",
										"resonance_flares":"Instinctive magical surges, or 'flares,' during adolescence mark the alignment of Kori and Tazri."
									},
									"reproduction":{
										"natural":"Sterile by default due to fundamental incompatibility between elf and dragonkin.",
										"arcane":"Possible only through deliberate, intense Tazri intervention and perfect Kori-Tazri harmonization. Such births are sacred, rare, and typically mark significant omens or turning points."
									},
									"philosophy":"Existence is not inheritance but covenant: a promise to balance what was lost and what can yet be made whole."
								},
								"traits":{
									"appearance":"Elf-like with silvery or pearl-toned skin, subtle scale patterns along the forearms, back, and temples, and eyes that glow faintly gold or emerald. Lithe and graceful, yet bearing a quiet draconic power beneath the surface.",
									"physique":"Tall and agile (1.8–2.0 m, 65–85 kg), balanced between elven fluidity and dragonborn resilience. Movements are measured and precise.",
									"magic":"Naturally attuned to both Kori and Tazri—magical expression comes as much from emotion and instinct as from conscious ritual.",
									"sensory_organs":{
										"vision":"Rivals elven acuity, but with the added perception of emotion and arcane resonance as color or pattern.",
										"hearing":"Capable of discerning truth or deception as broken or harmonious tones; can sense the subtle resonance of spellcraft.",
										"extrasensory":"Their balanced Kori and Tazri allow them to sense magical disturbances, emotional shifts, and changes in weather or fate."
									}
								},
								"reproduction":{
									"sterility":"Default state—unable to bear children by natural means.",
									"magical_birth":"Rare, requires powerful ritual and perfect magical balance."
								},
								"growth":{
									"early":"Infants are preternaturally calm and observant, developing agility and verbal skills early (age 6–12).",
									"adolescence":"Begins near 20, marked by first resonance flares—unique bursts of blended magic. Lasts several decades.",
									"adulthood":"Full maturity by ~45, emotional and magical balance stabilizes. Lifespan ranges 220–300 years.",
									"elderhood":"Some dissolve into dust and silence, their body returning to the elements when perfect balance is achieved."
								},
								"intelligence":{
									"type":"",
									"strengths":[
										
									]
								},
								"controversies":[
									"Feared or mistrusted by both parent lineages for their liminal nature.",
									"Seen as a symbol of dangerous convergence, or of lost unity between elves and dragonborn.",
									"Their existence challenges the purity doctrines of both High Elves and Saarotsos."
								],
								"lore":{
									"origin_myth":"Aedhelirsos are said to be the last living echoes of the first_age, born where the Hah'Slen and Rúth'Sunvaar once mingled before their fall.",
									"core_legends":[
										"Some claim the first Aedhelirsos was born at the twilight of the War of One and All—a living bridge meant to heal the wound between fire and memory.",
										"Stories tell of those who, at the end of their life, dissolve into starlight and leave only a song or silent echo in their place."
									],
									"taboos":[
										"Revealing the precise rituals used for magical conception to outsiders.",
										"Using both Kori and Tazri to harm kin—a betrayal seen as a shattering of their very purpose.",
										"Seeking power for its own sake; balance is the highest law."
									]
								},
								"habitat":"High forests, volcanic caverns, liminal settlements—where boundaries between magic and memory are thin.",
								"distribution":[
									"Silgolt (rare enclaves)",
									"Mixed cities where Elven and Dovagoraan cultures meet"
								],
								"related_species":[
									"Kaelotaedhel",
									"Saarotsos"
								],
								"notable_magic":[
									"Spellweaving—blending Kori and Tazri",
									"Resonance perception—seeing or hearing magic as color and sound",
									"Instinctive counterspells"
								]
							}
