"Saarotsos":{
						"english":"Saarotsos",
						"sigtaara":"SÂROTSOS",
						"native_name":"Saarotsos",
						"family":"Kaesendova",
						"genus":"Dovahsos",
						"species":"Vahzahdov",
						"appeared_in_age":"second_age",
						"genetic_ancestors":[
							"Dragons"
						],
						"genetic_descendants":[
							"Aedhelirsos",
							"Lokraasos"
						],
						"origin":[
							"Eastern Silgolt"
						],
						"home_continent":"Silgolt",
						"geographic_distribution":[
							"Eastern Silgolt"
						],
						"magical_affinity":[
							"Kori"
						],
						"hybrid":false,
						"artificial":false,
						"culture":{
							"core_values":[
								"mastery of the inner flame (Kori)",
								"strength through trial",
								"remembrance of bloodline",
								"honor through achievement, not birth"
							],
							"origins":"Forged in the memory of dragons, Saarotsos society is built on the awakening and mastery of Kori, the Flame Within. True personhood is only achieved after spiritual rites—Ko'Gornazil and Ko'Wokazil.",
							"society":"Stratified yet meritocratic: only those who have awakened their Kori are recognized as full citizens. Martial and mystical, with an emphasis on silent discipline and earning one's name through fire.",
							"institutions":{
								"Revakgol Empire":"The current unifying dominion, ruled by an Emperor chosen by trial and acclaim among the Dovjun.",
								"Dovahrein":"High council of Dovjun (Dragonlords) from each citadel, whose collective voice determines imperial law, war, and ritual.",
								"Kavahl":"Communal hatcheries where eggs are incubated and watched by flamekeepers."
							},
							"social_structure":"Hierarchical yet based on achieved burn rather than mere inheritance. Dovjun (rulers), Tufae (warrior-champions/flamepriests), Yol'Tikjootuz (the fire-sworn populace), and Wek'Kirii (the 'blind' pre-Kori young). Lokraasos (rare winged) stand outside standard ranks.",
							"traditions":{
								"Kori Trials":"Rites marking the stirrings and awakenings of the Inner Flame, which define stages of personhood.",
								"Naming":"Names are only earned, never given at birth—awarded after passing Ko'Wokazil.",
								"Flame-marks":"Living sigils of lineage and accomplishment, appearing on the inner arm upon awakening.",
								"Clan Trials":"Lineage and bloodline rites, including trial by flame or duel for succession."
							},
							"beauty_ideals":[
								"Burning eyes, vivid scale pattern, prominent horns, and bearing that reveals disciplined will. Stature, endurance, and the clarity of one’s 'burn' are admired."
							],
							"gender_roles":{
								"male":[
									"Generally larger, broader, with heavier horns. Take on ceremonial, martial, and architectural roles; often rule as Dovjun."
								],
								"female":[
									"More compact, agile, with sharper claws and sensory ridges. Common among spiritual guides, flamekeepers, and tacticians."
								]
							},
							"relationship_ideals":"Bonds are formed by shared trial, proven loyalty, and compatibility of flame. Romantic unions are sacred, but always subordinate to the needs of clan and Empire.",
							"taboos":[
								"Bearing a name without earning it",
								"Failing to awaken Kori",
								"Disrespecting one’s flame or that of another",
								"Killing a Lokraasos"
							],
							"xenophobia":"Cautious and proud, but not isolationist—outsiders are judged by strength and flame, not birth.",
							"influence":"Empire of Revakgol, Dovahrein, strong architectural and arcane presence across Silgolt.",
							"notable_events":[
								"Unification under Kaemisyol",
								"Birth of the Revakgol Empire",
								"First appearance of Lokraasos",
								"Rise of the Dovahrein"
							],
							"related_organizations":[
								"Empire of Revakgol",
								"The Dragon Gods - Firhohii"
							]
						},
						"traits":{
							"appearance":"Tall (1.9–2.3m), robust, muscular, covered in bronze, emerald, or obsidian scales. Long tails (2.6–3m total length), spiral horns, burning slit-pupiled eyes, and distinct draconic features. Deep, resonant voices.",
							"magical_style":"Kori (the Inner Flame): spiritual, will-based magic. All arts, rituals, and even law revolve around the mastery of this innate power.",
							"lifespan":"Approx. 140 years (longer in rare cases of disciplined Kori).",
							"physiology":{
								"skeleton":"Dense, interlocking plates; reinforced marrow; robust cranial horns.",
								"musculature":"Powerful, long, endurance-optimized; suited for sudden bursts and long conflict.",
								"respiration":"Bifurcated, highly efficient for heat and toxin resistance.",
								"circulation":"",
								"dermal":"Colorful, armored scales (bronze, obsidian, jade); chest is thick, smooth skin.",
								"hair":"",
								"senses":[
									"Infrared vision"
								],
								"adaptations":[
									"Resistance to heat/blunt force",
									"Vestigial ridges or membrane traces in some lineages"
								]
							},
							"reproduction":{
								"method":"Sexual, oviparous (eggs)",
								"cycle":"Low fertility; clutches of 1-2 eggs, laid after long gestation.",
								"gestation":"",
								"development":"Rapid growth (0–5 years), ossification and scale thickening; horns and secondary traits emerge by 10–30 years.",
								"courtship":"",
								"interbreeding":"Rare with other Dovagoraan; offspring often infertile or Kori-dormant ('dim-blooded').",
								"cultural_influence":"Eggs incubated in communal, flame-warmed Kavahls. Flamekeepers oversee hatching and perform rites."
							},
							"growth":{
								"infancy":"",
								"childhood":"",
								"adolescence":"",
								"adulthood":""
							},
							"growth_rate":"Continuous, resilience-oriented; no abrupt puberty/metamorphosis.",
							"sexual_dimorphism":"Males: larger, heavier horns; Females: sharper claws, sensory ridges."
						},
						"intelligence":{
							"type":"Strategic, contemplative, martial and mystical.",
							"strengths":[
								"Martial and architectural innovation",
								"Spiritual discipline",
								"Collective memory (oral tradition, flame-marks)"
							],
							"learning_style":"Trial, challenge, oral lore, and direct apprenticeship.",
							"comparison_to_human":"Above human average; strong pattern-recognition and emotional self-control."
						},
						"controversies":[
							"Strict meritocracy leaves Wek'Kirii in social limbo.",
							"Occasional clan feuds, dueling, and succession trials turn bloody.",
							"Ambiguous treatment of 'dim-blooded' crossbreeds.",
							"Intimidating rites and law to outsiders."
						],
						"lore":{
							"origin_myth":"Born of fire and remembrance, Saarotsos claim descent from dragons—their flame is legacy, not accident. Each must awaken Kori to become truly alive.",
							"founders":[
								"First Dovjun",
								"Kaemisyol (the Conqueror)"
							],
							"core_legends":[
								"The First Awakening of Kori",
								"Unification under Revakgol",
								"The Divine Birth of a Lokraasos"
							],
							"taboos":[
								"Dilution of bloodline",
								"Betrayal of kin or tradition",
								"Uttering private names to outsiders",
								"Refusing funerary rites"
							]
						},
						"habitat":"Citadels and cities of obsidian and bronze in eastern Silgolt; volcanic and mountainous regions.",
						"distribution":[
							"Eastern Silgolt"
						],
						"related_species":[
							"Lokraasos",
							"Aedhelirsos",
							"Dragons"
						],
						"notable_magic":[
							"Kori (Innate Flame Magic)",
							"Flamebinding",
							"Sacred Rites of the Dovahrein"
						],
						"related_organizations":[
							"Empire of Revakgol",
							"The Dragon Gods - Firhohii"
						],
						"subspecies":[
							"Zegtuzsos",
							"Aedhelirsos"
						]
					}
